package engine

import "github.com/willf/bitset"

const kingVal = 3000

var (
	// RedRookPstValue 红车位置价值
	RedRookPstValue [256]int = [...]int{
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 160, 170, 190, 210, 200, 210, 190, 170, 160, 0, 0, 0, 0, 0,
		0, 0, 180, 190, 190, 210, 200, 210, 190, 190, 180, 0, 0, 0, 0, 0,
		0, 0, 180, 190, 190, 210, 200, 210, 190, 190, 180, 0, 0, 0, 0, 0,
		0, 0, 180, 190, 190, 200, 200, 200, 190, 190, 180, 0, 0, 0, 0, 0,
		0, 0, 190, 200, 200, 210, 210, 210, 200, 200, 190, 0, 0, 0, 0, 0,
		0, 0, 190, 200, 200, 210, 210, 210, 200, 200, 190, 0, 0, 0, 0, 0,
		0, 0, 190, 200, 200, 210, 210, 210, 200, 200, 190, 0, 0, 0, 0, 0,
		0, 0, 190, 200, 200, 210, 210, 210, 200, 200, 190, 0, 0, 0, 0, 0,
		0, 0, 190, 200, 200, 215, 220, 215, 200, 200, 190, 0, 0, 0, 0, 0,
		0, 0, 190, 200, 200, 210, 210, 210, 200, 200, 190, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
	}
	// BlackRookPstValue 黑车位置价值
	BlackRookPstValue [256]int = [...]int{
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 190, 200, 200, 210, 210, 210, 200, 200, 190, 0, 0, 0, 0, 0,
		0, 0, 190, 200, 200, 220, 220, 220, 200, 200, 190, 0, 0, 0, 0, 0,
		0, 0, 190, 200, 200, 210, 210, 210, 200, 200, 190, 0, 0, 0, 0, 0,
		0, 0, 190, 200, 200, 210, 210, 210, 200, 200, 190, 0, 0, 0, 0, 0,
		0, 0, 190, 200, 200, 210, 210, 210, 200, 200, 190, 0, 0, 0, 0, 0,
		0, 0, 190, 200, 200, 210, 210, 210, 200, 200, 190, 0, 0, 0, 0, 0,
		0, 0, 180, 190, 190, 200, 200, 200, 190, 190, 180, 0, 0, 0, 0, 0,
		0, 0, 180, 190, 190, 210, 200, 210, 190, 190, 180, 0, 0, 0, 0, 0,
		0, 0, 180, 190, 190, 210, 200, 210, 190, 190, 180, 0, 0, 0, 0, 0,
		0, 0, 160, 170, 190, 210, 200, 210, 190, 170, 160, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
	}
	// RedCannonPstValue 红炮位置价值
	RedCannonPstValue [256]int = [...]int{
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 0, 0, 0, 0, 0,
		0, 0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 0, 0, 0, 0, 0,
		0, 0, 100, 100, 100, 100, 110, 100, 100, 100, 100, 0, 0, 0, 0, 0,
		0, 0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 0, 0, 0, 0, 0,
		0, 0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 0, 0, 0, 0, 0,
		0, 0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 0, 0, 0, 0, 0,
		0, 0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 0, 0, 0, 0, 0,
		0, 0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 0, 0, 0, 0, 0,
		0, 0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 0, 0, 0, 0, 0,
		0, 0, 110, 100, 100, 100, 100, 100, 100, 100, 110, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
	}

	// BlackCannonPstValue 黑炮位置价值
	BlackCannonPstValue [256]int = [...]int{
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 110, 100, 100, 100, 100, 100, 100, 100, 110, 0, 0, 0, 0, 0,
		0, 0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 0, 0, 0, 0, 0,
		0, 0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 0, 0, 0, 0, 0,
		0, 0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 0, 0, 0, 0, 0,
		0, 0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 0, 0, 0, 0, 0,
		0, 0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 0, 0, 0, 0, 0,
		0, 0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 0, 0, 0, 0, 0,
		0, 0, 100, 100, 100, 100, 110, 100, 100, 100, 100, 0, 0, 0, 0, 0,
		0, 0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 0, 0, 0, 0, 0,
		0, 0, 100, 100, 100, 100, 100, 100, 100, 100, 100, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
	}
	// RedKnightPstValue 红马位置价值
	RedKnightPstValue [256]int = [...]int{
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 70, 80, 80, 80, 80, 80, 80, 80, 70, 0, 0, 0, 0, 0,
		0, 0, 70, 95, 80, 95, 50, 95, 80, 95, 70, 0, 0, 0, 0, 0,
		0, 0, 80, 95, 95, 95, 95, 95, 95, 95, 80, 0, 0, 0, 0, 0,
		0, 0, 80, 95, 95, 95, 95, 95, 95, 95, 80, 0, 0, 0, 0, 0,
		0, 0, 80, 95, 100, 95, 95, 95, 100, 95, 80, 0, 0, 0, 0, 0,
		0, 0, 80, 95, 95, 95, 95, 95, 95, 95, 80, 0, 0, 0, 0, 0,
		0, 0, 80, 110, 95, 95, 95, 95, 95, 110, 80, 0, 0, 0, 0, 0,
		0, 0, 80, 95, 95, 110, 95, 110, 95, 95, 80, 0, 0, 0, 0, 0,
		0, 0, 80, 95, 120, 95, 95, 95, 120, 95, 80, 0, 0, 0, 0, 0,
		0, 0, 80, 80, 80, 80, 80, 80, 80, 80, 80, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
	}
	// BlackKnightPstValue 黑马位置价值
	BlackKnightPstValue [256]int = [...]int{
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 80, 95, 95, 95, 95, 95, 95, 95, 80, 0, 0, 0, 0, 0,
		0, 0, 80, 95, 120, 95, 95, 95, 120, 95, 80, 0, 0, 0, 0, 0,
		0, 0, 80, 95, 95, 110, 95, 110, 95, 95, 80, 0, 0, 0, 0, 0,
		0, 0, 80, 110, 95, 95, 95, 95, 95, 110, 80, 0, 0, 0, 0, 0,
		0, 0, 80, 95, 95, 95, 95, 95, 95, 95, 80, 0, 0, 0, 0, 0,
		0, 0, 80, 95, 100, 95, 95, 95, 100, 95, 80, 0, 0, 0, 0, 0,
		0, 0, 80, 95, 95, 95, 95, 95, 95, 95, 80, 0, 0, 0, 0, 0,
		0, 0, 80, 95, 95, 95, 95, 95, 95, 95, 80, 0, 0, 0, 0, 0,
		0, 0, 70, 95, 80, 95, 50, 95, 80, 95, 70, 0, 0, 0, 0, 0,
		0, 0, 70, 80, 80, 80, 80, 80, 80, 80, 70, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
	}
	// RedBishopPstValue 红相位置价值
	RedBishopPstValue [256]int = [...]int{
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 32, 0, 0, 0, 32, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 25, 0, 0, 0, 38, 0, 0, 0, 25, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 30, 0, 0, 0, 30, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
	}
	// BlackBishopPstValue 黑象位置价值
	BlackBishopPstValue [256]int = [...]int{
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 30, 0, 0, 0, 30, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 25, 0, 0, 0, 38, 0, 0, 0, 25, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 32, 0, 0, 0, 32, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
	}
	// RedAdvisorPstValue 红士位置价值
	RedAdvisorPstValue [256]int = [...]int{
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 30, 0, 30, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 28, 0, 28, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
	}
	// BlackAdvisorPstValue 黑士位置价值
	BlackAdvisorPstValue [256]int = [...]int{
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 28, 0, 28, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 27, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 30, 0, 30, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
	}
	// RedKingPstValue 红帅位置价值
	RedKingPstValue [256]int = [...]int{
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 15 + kingVal, 20 + kingVal, 15 + kingVal, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 10 + kingVal, 10 + kingVal, 10 + kingVal, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 1 + kingVal, 1 + kingVal, 1 + kingVal, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
	}
	// BlackKingPstValue 黑将位置价值
	BlackKingPstValue [256]int = [...]int{
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 1 + kingVal, 1 + kingVal, 1 + kingVal, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 10 + kingVal, 10 + kingVal, 10 + kingVal, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 15 + kingVal, 20 + kingVal, 15 + kingVal, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
	}
	// RedPawnPstValue 红兵位置价值
	RedPawnPstValue [256]int = [...]int{
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 10, 0, 10, 0, 17, 0, 10, 0, 10, 0, 0, 0, 0, 0,
		0, 0, 12, 0, 17, 0, 17, 0, 17, 0, 12, 0, 0, 0, 0, 0,
		0, 0, 15, 20, 20, 20, 20, 20, 20, 20, 15, 0, 0, 0, 0, 0,
		0, 0, 20, 25, 25, 30, 30, 30, 25, 25, 20, 0, 0, 0, 0, 0,
		0, 0, 24, 29, 39, 50, 50, 50, 39, 29, 24, 0, 0, 0, 0, 0,
		0, 0, 25, 30, 40, 50, 60, 50, 40, 30, 25, 0, 0, 0, 0, 0,
		0, 0, 10, 10, 10, 20, 20, 20, 10, 10, 10, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
	}
	// BlackPawnPstValue 黑兵位置价值
	BlackPawnPstValue [256]int = [...]int{
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 10, 10, 10, 20, 20, 20, 10, 10, 10, 0, 0, 0, 0, 0,
		0, 0, 25, 30, 40, 50, 60, 50, 40, 30, 25, 0, 0, 0, 0, 0,
		0, 0, 24, 29, 39, 50, 50, 50, 39, 29, 24, 0, 0, 0, 0, 0,
		0, 0, 20, 25, 25, 30, 30, 30, 25, 25, 20, 0, 0, 0, 0, 0,
		0, 0, 15, 20, 20, 20, 20, 20, 20, 20, 15, 0, 0, 0, 0, 0,
		0, 0, 12, 0, 17, 0, 17, 0, 17, 0, 12, 0, 0, 0, 0, 0,
		0, 0, 10, 0, 10, 0, 17, 0, 10, 0, 10, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
		0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0, 0,
	}
)

func rookValue(sq int, isRed bool) int {
	if isRed {
		return RedRookPstValue[sq]
	}
	return BlackRookPstValue[sq]
}

func knightValue(sq int, isRed bool) int {
	if isRed {
		return RedKnightPstValue[sq]
	}
	return BlackKnightPstValue[sq]
}

func cannonValue(sq int, isRed bool) int {
	if isRed {
		return RedCannonPstValue[sq]
	}
	return BlackCannonPstValue[sq]
}

func advisorValue(sq int, isRed bool) int {
	if isRed {
		return RedAdvisorPstValue[sq]
	}
	return BlackAdvisorPstValue[sq]
}

func bishopValue(sq int, isRed bool) int {
	if isRed {
		return RedBishopPstValue[sq]
	}
	return BlackBishopPstValue[sq]
}

func kingValue(sq int, isRed bool) int {
	if isRed {
		return RedKingPstValue[sq]
	}
	return BlackKingPstValue[sq]
}

func pawnValue(sq int, isRed bool) int {
	if isRed {
		return RedPawnPstValue[sq]
	}
	return BlackPawnPstValue[sq]
}

// 缺士车加分
func (p *Position) rookAwardVal(isRed bool) int {
	// TODO
	return 0
}

// 缺象炮加分
func (p *Position) cannonAwardVal(isRed bool) int {
	// TODO
	return 0
}

// knightDexterity 马罚分.
func (p *Position) knightDexterity(sq int, isRed bool) int {
	var (
		punishVal int
		selfPs    *bitset.BitSet
		sidePs    *bitset.BitSet
	)
	if isRed {
		selfPs, sidePs = p.Red, p.Black
	} else {
		selfPs, sidePs = p.Black, p.Red
	}
	blocksDeltas := []int{0x01, -0x01, 0x10, -0x10}
	for _, blockDelta := range blocksDeltas {
		if selfPs.Test(uint(sq + blockDelta)) {
			punishVal -= 5
		} else if sidePs.Test(uint(sq + blockDelta)) {
			punishVal -= 9
		}
	}
	return punishVal
}

const exposedCannonVal = 55

// isExposedCannon 是否空头.
func (p *Position) isExposedCannon(cannonSq uint, isRed bool) int {
	var beCheckKingSq uint
	if isRed {
		blackKing := p.Kings.Intersection(p.Black)
		beCheckKingSq, _ = blackKing.NextSet(0)
	} else {
		beCheckKingSq, _ = p.Kings.NextSet(0)
	}
	// XXX debug
	if beCheckKingSq == 0 {
		return 0
	}
	rookAttacks := RookAttacks[int(beCheckKingSq)]
	if !rookAttacks.Test(cannonSq) {
		return 0
	}
	if File(int(cannonSq)) == File(int(beCheckKingSq)) {
		if !p.IsAnyPieceBetweenFile(int(cannonSq), int(beCheckKingSq)) {
			return exposedCannonVal
		}
	} else if Rank(int(cannonSq)) == Rank(int(beCheckKingSq)) {
		if !p.IsAnyPieceBetweenRank(int(cannonSq), int(beCheckKingSq)) {
			return exposedCannonVal
		}
	}
	return 0
}

func (p *Position) Evaluate() int {
	var eval = 0

	redRooks := p.Rooks.Intersection(p.Red)
	for sq, e := redRooks.NextSet(0); e; sq, e = redRooks.NextSet(sq + 1) {
		eval += rookValue(int(sq), true)
	}
	blackRooks := p.Rooks.Intersection(p.Black)
	for sq, e := blackRooks.NextSet(0); e; sq, e = blackRooks.NextSet(sq + 1) {
		eval -= rookValue(int(sq), false)
	}

	redCannons := p.Cannons.Intersection(p.Red)
	for sq, e := redCannons.NextSet(0); e; sq, e = redCannons.NextSet(sq + 1) {
		eval += cannonValue(int(sq), true)
		eval += p.isExposedCannon(sq, true)
	}
	blackCannons := p.Cannons.Intersection(p.Black)
	for sq, e := blackCannons.NextSet(0); e; sq, e = blackCannons.NextSet(sq + 1) {
		eval -= cannonValue(int(sq), false)
		eval -= p.isExposedCannon(sq, false)
	}

	redKnights := p.Knights.Intersection(p.Red)
	for sq, e := redKnights.NextSet(0); e; sq, e = redKnights.NextSet(sq + 1) {
		eval += knightValue(int(sq), true)
		eval += p.knightDexterity(int(sq), true)
	}
	blackKnights := p.Knights.Intersection(p.Black)
	for sq, e := blackKnights.NextSet(0); e; sq, e = blackKnights.NextSet(sq + 1) {
		eval -= knightValue(int(sq), false)
		eval -= p.knightDexterity(int(sq), false)
	}

	redPawns := p.Pawns.Intersection(p.Red)
	for sq, e := redPawns.NextSet(0); e; sq, e = redPawns.NextSet(sq + 1) {
		eval += pawnValue(int(sq), true)
	}
	blackPawns := p.Pawns.Intersection(p.Black)
	for sq, e := blackPawns.NextSet(0); e; sq, e = blackPawns.NextSet(sq + 1) {
		eval -= pawnValue(int(sq), false)
	}

	redBishops := p.Bishops.Intersection(p.Red)
	for sq, e := redBishops.NextSet(0); e; sq, e = redBishops.NextSet(sq + 1) {
		eval += bishopValue(int(sq), true)
	}
	blackBishops := p.Bishops.Intersection(p.Black)
	for sq, e := blackBishops.NextSet(0); e; sq, e = blackBishops.NextSet(sq + 1) {
		eval -= bishopValue(int(sq), false)
	}

	redAdvisors := p.Advisors.Intersection(p.Red)
	for sq, e := redAdvisors.NextSet(0); e; sq, e = redAdvisors.NextSet(sq + 1) {
		eval += advisorValue(int(sq), true)
	}
	blackAdvisors := p.Advisors.Intersection(p.Black)
	for sq, e := blackAdvisors.NextSet(0); e; sq, e = blackAdvisors.NextSet(sq + 1) {
		eval -= advisorValue(int(sq), false)
	}

	redKingSq, _ := p.Kings.NextSet(0)
	if redKingSq > 0x50 { // 无帅
		return -kingVal
	}
	eval += kingValue(int(redKingSq), true)
	blackKingSq, _ := p.Kings.NextSet(redKingSq + 1)
	eval -= kingValue(int(blackKingSq), false)

	return eval
}
